# LongerThanPossible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DecalFailures..::..LongerThanPossible Property
BuiltInFailures..::..DecalFailures Class See Also
---
Decal element is longer than the circumference of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LongerThanPossible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LongerThanPossible As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LongerThanPossible {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DecalFailures Class
Autodesk.Revit.DB Namespace